#+FILETAGS: PERSONAL @errand

TODO.org contains personal tasks and things to keep track of. Basically, tasks that needs to be done, but doesn't belong to another other tasks.

* Inbox
* Special dates
:PROPERTIES:
:CATEGORY: Spacial Date
:END:
** Birthdays
** Anniversaries
* Finance :finance:
:PROPERTIES:
:CATEGORY: Finance
:END:
* Health and recreation :health:
:PROPERTIES:
:CATEGORY: Health
:END:
* House maintenance :house:
:PROPERTIES:
:CATEGORY: Note
:END:
** TODO pay for FPL. and ask jared to pay me half.
[2022-02-24 Thu 23:26]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*]]
** TODO wash by blanket.
SCHEDULED: <2022-02-26 Sat>
[2022-02-25 Fri 11:10]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*Entity types that do not have key attributes of their own are called weak entity types. In contrast, regular entity types that do have a key attributewhich include all the examples discussed so farare called strong entity types][Entity types that do not have key attributes of their own are called weak entity types. In contrast, regular entity types that do have a key attributewhich include all the examples discussed so farare called strong entity types]]
** TODO clean my couch. (prevent my back from getting rash)
[2022-02-25 Fri 11:10]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*Entity types that do not have key attributes of their own are called weak entity types. In contrast, regular entity types that do have a key attributewhich include all the examples discussed so farare called strong entity types][Entity types that do not have key attributes of their own are called weak entity types. In contrast, regular entity types that do have a key attributewhich include all the examples discussed so farare called strong entity types]]
** TODO clean my jacket, towel.
SCHEDULED: <2022-02-26 Sat>
:LOGBOOK:
CLOCK: [2022-02-25 Fri 15:45]--[2022-02-25 Fri 15:46] =>  0:01
:END:
[2022-02-25 Fri 15:45]
** TODO talk to community about fixing internet.
SCHEDULED: <2022-02-26 Sat>
[2022-02-26 Sat 00:35]
[[file:~/org/todo.org::+FILETAGS: PERSONAL]]
** TODO clean my toilet. :@errand:
:LOGBOOK:
CLOCK: [2022-02-22 Tue 09:49]--[2022-02-22 Tue 09:50] =>  0:01
:END:
[2022-02-22 Tue 09:49]
[[file:/mnt/c/Users/terng/OneDrive/Documents/Working/tgn/evaluation/sliding_window.py::def evaluate_epoch(self, ensemble_idx, epoch, num_batch_pair, checkpoint_loss):]]
*** NEXT check if I have all the cleaning product to learn toilet, if not, buy it from cvs.
** TODO restock by bathroom product. collect things I need to buy. then go and buy them.
SCHEDULED: <2022-02-26 Sat>
:LOGBOOK:
CLOCK: [2022-02-22 Tue 09:50]--[2022-02-22 Tue 09:51] =>  0:01
:END:
[2022-02-22 Tue 09:50]
[[file:/mnt/c/Users/terng/OneDrive/Documents/Working/tgn/evaluation/sliding_window.py::def evaluate_epoch(self, ensemble_idx, epoch, num_batch_pair, checkpoint_loss):]]
*** NEXT buy facial product to clean my face. (I ran out of it.)
*** NEXT buy paper rolled
* Notes
:PROPERTIES:
:CATEGORY: Note
:END:
* Tasks
:PROPERTIES:
:CATEGORY: Task
:END:
** TODO Install Info Plus to get the history pesist functionality.
:LOGBOOK:
CLOCK: [2022-02-20 Sun 09:47]--[2022-02-20 Sun 09:49] =>  0:02
:END:
[2022-02-20 Sun 09:47]
** TODO update phone OS and buy iphone storage. :@errand:
:LOGBOOK:
CLOCK: [2022-02-21 Mon 21:48]--[2022-02-21 Mon 21:49] =>  0:01
:END:
[2022-02-21 Mon 21:48]
[[file:~/org/journal.org::*shower][shower]]
** TODO check passport expired date
** TODO rewriting my resume
SCHEDULED: <2022-02-27 Sun>
** TODO make an appointment time for my hair cut.
SCHEDULED: <2022-02-26 Sat>
[2022-02-23 Wed 23:20]
[[file:~/Documents/Courses/FAU/2022/spring/functional-programming-with-scala/hw2/src/main.scala::}]]
** NEXT figure out a way to increase space in my iphone. :@errand:
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:04]--[2022-02-24 Thu 11:05] =>  0:01
:END:
[2022-02-24 Thu 11:04]
[[file:~/org/refile.org::*When I am home, put my jacket in my bags.][When I am home, put my jacket in my bags.]]
** TODO plan out how to utilize linked in to be appeared as better propspect to be employed
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:10]--[2022-02-24 Thu 11:12] =>  0:02
:END:
[2022-02-24 Thu 11:10]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
*** TODO figure out how often I should post on linkedIn and what content I should tweet about? do research on this.
** TODO read this email https://mail.google.com/mail/u/0/#inbox/FMfcgzGmvBpdjhSVwkfgqdzcsTtkhgrL
SCHEDULED: <2022-02-24 Thu>
[2022-02-24 Thu 11:14]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
** TODO clean up my email. remove recurring email.  remove notification.
SCHEDULED: <2022-02-26 Sat>
[2022-02-24 Thu 11:15]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
** TODO calculate cost of AT&T that jared hasn't paid me yet. (figure out last time jared paid me, and how much he owe me.) :@errand:
SCHEDULED: <2022-02-26 Sat>
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:15]--[2022-02-24 Thu 11:16] =>  0:01
:END:
[2022-02-24 Thu 11:15]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
** TODO put deadline of summer 2022 in my schedule. or schedule task to remind me to look at the summer 2022 schedule. (https://www.fau.edu/registrar/pdf/Summer2022_08182021.pdf)
[2022-02-24 Thu 16:04]
[[file:~/org/GTD.org::*write down my version of GTD purposed -> action models under Getting projects Creatively Under (7.48 hour left mins mark) for all aspect in life I want to achieve.][write down my version of GTD purposed -> action models under Getting projects Creatively Under (7.48 hour left mins mark) for all aspect in life I want to achieve.]]
** TODO check truebill and start creating budget for weekly for the rest of the year.
SCHEDULED: <2022-02-26 Sat>
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:23]--[2022-02-24 Thu 18:24] =>  0:01
:END:
[2022-02-24 Thu 18:23]
[[file:~/org/PhD.org::*Tasks][Tasks]]
** TODO figure out if I can pay this semester with cash. (best option for me, because I dont need to deposite 5k)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:24]--[2022-02-24 Thu 18:25] =>  0:01
:END:
[2022-02-24 Thu 18:24]
[[file:~/org/refile.org::*check truebill and start creating budget for weekly for the rest of the year.][check truebill and start creating budget for weekly for the rest of the year.]]
** TODO collect my brother question from facebook to ask the real estate guy.
SCHEDULED: <2022-02-26 Sat>
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:32]--[2022-02-24 Thu 18:33] =>  0:01
:END:
[2022-02-24 Thu 18:32]
[[file:~/org/school.org::*get overview of all the questios and write down things that I need to know before starting to code. Watch lecture accordingly][get overview of all the questios and write down things that I need to know before starting to code. Watch lecture accordingly]]
** TODO clear virus on my iphone.
SCHEDULED: <2022-03-02 Wed>
:LOGBOOK:
CLOCK: [2022-02-24 Thu 22:36]--[2022-02-24 Thu 22:37] =>  0:01
:END:
[2022-02-24 Thu 22:36]
** TODO collect yearly, month events, and important documentations (such as visa.) and put them into org agenda. I should also scan important documentation into pdf or other mean that can be easily store and search via emacs.
:LOGBOOK:
CLOCK: [2022-02-24 Thu 22:45]--[2022-02-24 Thu 22:47] =>  0:02
:END:
[2022-02-24 Thu 22:45]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*key attributes of entity types][key attributes of entity types]]
* Vehicle maintenance
:PROPERTIES:
:CATEGORY: Vehicle
:END:
** TODO Register a car
DEADLINE: <2022-03-19 Sat>
*** TODO talk to the car tool guy about the price. (discount for the fixed date that I will get.) (toll back to my apartment, so I don't have to pay per day toll)
SCHEDULED: <2022-02-26 Sat>
*** TODO Go to DMV at 7am to get my driver licence. (The schedule date is set to remind that I need to start plan out my actions towards completing this tasks.)
SCHEDULED: <2022-03-04 Fri>
:LOGBOOK:
CLOCK: [2022-02-21 Mon 23:23]--[2022-02-21 Mon 23:24] =>  0:01
:END:
[2022-02-21 Mon 23:23]
[[file:~/org/todo.org::*Vehicle maintenance][Vehicle maintenance]]
*** NEXT Before getting my car register, I need to do research on how to get a car certificate. after I figure this out, plan out the date and time in which I will get my car register.

* Passwords
:PROPERTIES:
:CATEGORY: Password
:END:
* Habits
** NEXT start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.)
SCHEDULED: <2022-02-24 Thu>
[2022-02-24 Thu 22:55]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*domain defines all possible values for attribute.][domain defines all possible values for attribute.]]
SCHEDULED: <2022-02-24 Thu .+1d/3d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:END:
** NEXT Drink 1 gallon of water daily. Always buy 1 gallon of water on the way to walking home.
[2022-02-24 Thu 22:57]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*logical design or data model mapping][logical design or data model mapping]]
SCHEDULED: <2022-02-24 Thu .+1d/3d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:END:
** NEXT learn about pen.el codebase + prompt programming daily or bi-daily.
[2022-02-24 Thu 22:58]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*3.2 A sample database application][3.2 A sample database application]]
SCHEDULED: <2022-02-24 Thu .+1d/3d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:END:
